performance/test.yml
config:
  target: https://staging.submit-social-housing-data.levellingup.gov.uk
  engines:
    playwright: { aggregateByName: true, extendedMetrics: true, defaultTimeout: 90 }
  processor: "./flows.js"
  phases:
    - name: one
      duration: 60
      arrivalCount: 10
    - name: two
      duration: 60
      arrivalRate: 20
    - name: three
      duration: 60
      arrivalCount: 30
    - name: four
      duration: 600
      arrivalRate: 1
      rampTo: 10
    - name: five
      duration: 600
      arrivalRate: 10
      maxVusers: 8000
  payload:
    path: "users.csv"
    fields:
      - "username"
      - "password"
      - "logReference"
      - "hasOrgRelationships"
      - "schemeSearchTerm"
    name: user
scenarios:
  - name: lettings-log-gn
    weight: 3
    engine: playwright
    testFunction: "fillInGeneralNeedsLettingsLog"
  - name: lettings-log-sh
    weight: 3
    engine: playwright
    testFunction: "fillInSupportedHousingLettingsLog"
  - name: browse
    weight: 1
    engine: playwright
    testFunction: "browse"
  - name: search-logs
    weight: 4
    engine: playwright
    testFunction: "searchLogs"